Revit 2026 API

# FabricationPartIsSameAs Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsSameAs(
	FabricationPart part,
	IList<FabricationPartCompareType> ignoreFields
)
```
```vb
Public Function IsSameAs (
	part As FabricationPart,
	ignoreFields As IList(Of FabricationPartCompareType)
) As Boolean
```
```cpp
public:
bool IsSameAs(
	FabricationPart^ part,
	IList<FabricationPartCompareType>^ ignoreFields
)
```
```fsharp
member IsSameAs :
        part : FabricationPart *
        ignoreFields : IList<FabricationPartCompareType> -> bool
```

#### Parameters

part FabricationPart

ignoreFields IListFabricationPartCompareType

#### Return Value

Boolean

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace